/* automatically generated by rust-bindgen 0.72.1 */

pub const GW2_CHAT_SIGNATURE: u32 = 1735852643;
pub const GW2_CHAT_EVENT: &[u8; 16] = b"EV_CHAT:Message\0";
pub const MessageType_Error: MessageType = 0;
pub const MessageType_Guild: MessageType = 1;
pub const MessageType_GuildMotD: MessageType = 2;
pub const MessageType_Local: MessageType = 3;
pub const MessageType_Map: MessageType = 4;
pub const MessageType_Party: MessageType = 5;
pub const MessageType_Squad: MessageType = 6;
pub const MessageType_SquadMessage: MessageType = 7;
pub const MessageType_SquadBroadcast: MessageType = 8;
pub const MessageType_TeamPvP: MessageType = 9;
pub const MessageType_TeamWvW: MessageType = 10;
pub const MessageType_Whisper: MessageType = 11;
pub const MessageType_Emote: MessageType = 12;
pub const MessageType_EmoteCustom: MessageType = 13;
pub type MessageType = ::std::os::raw::c_uint;
pub const MetadataFlags_None: MetadataFlags = 0;
pub const MetadataFlags_Guild_IsRepresented: MetadataFlags = 1;
pub const MetadataFlags_Local_IsFromMentor: MetadataFlags = 4;
pub const MetadataFlags_Map_IsFromMentor: MetadataFlags = 4;
pub const MetadataFlags_Squad_IsFromCommander: MetadataFlags = 2;
pub const MetadataFlags_Party_IsFromCommander: MetadataFlags = 2;
pub const MetadataFlags_SquadMessage_IsBroadcast: MetadataFlags = 8;
pub const MetadataFlags_Whisper_IsFromMe: MetadataFlags = 16;
pub type MetadataFlags = ::std::os::raw::c_uint;
pub const MapId_EternalBattlegrounds: MapId = 38;
pub const MapId_GreenAlpineBorderlands: MapId = 95;
pub const MapId_BlueAlpineBorderlands: MapId = 96;
pub const MapId_ObsidianSanctum: MapId = 899;
pub const MapId_EdgeOfTheMists: MapId = 968;
pub const MapId_RedDesertBorderlands: MapId = 1099;
pub const MapId_ArmisitceBastion: MapId = 1315;
pub type MapId = ::std::os::raw::c_uint;
pub const EmoteType_Bless: EmoteType = 2166439537;
pub const EmoteType_Beckon: EmoteType = 2164331781;
pub const EmoteType_Dance: EmoteType = 2164736004;
pub const EmoteType_Sit: EmoteType = 2165181483;
pub const EmoteType_Yes: EmoteType = 2165121989;
pub const EmoteType_No: EmoteType = 1170800909;
pub const EmoteType_Cower: EmoteType = 2164686665;
pub const EmoteType_Laugh: EmoteType = 1171194125;
pub type EmoteType = ::std::os::raw::c_uint;
pub type StringUTF8 = *mut ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GloballyUniqueIdentifier {
    pub Data1: u32,
    pub Data2: u16,
    pub Data3: u16,
    pub Data4: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GloballyUniqueIdentifier"]
        [::std::mem::size_of::<GloballyUniqueIdentifier>() - 16usize];
    ["Alignment of GloballyUniqueIdentifier"]
        [::std::mem::align_of::<GloballyUniqueIdentifier>() - 4usize];
    ["Offset of field: GloballyUniqueIdentifier::Data1"]
        [::std::mem::offset_of!(GloballyUniqueIdentifier, Data1) - 0usize];
    ["Offset of field: GloballyUniqueIdentifier::Data2"]
        [::std::mem::offset_of!(GloballyUniqueIdentifier, Data2) - 4usize];
    ["Offset of field: GloballyUniqueIdentifier::Data3"]
        [::std::mem::offset_of!(GloballyUniqueIdentifier, Data3) - 6usize];
    ["Offset of field: GloballyUniqueIdentifier::Data4"]
        [::std::mem::offset_of!(GloballyUniqueIdentifier, Data4) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Timestamp {
    pub Low: u32,
    pub High: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Timestamp"][::std::mem::size_of::<Timestamp>() - 8usize];
    ["Alignment of Timestamp"][::std::mem::align_of::<Timestamp>() - 4usize];
    ["Offset of field: Timestamp::Low"][::std::mem::offset_of!(Timestamp, Low) - 0usize];
    ["Offset of field: Timestamp::High"][::std::mem::offset_of!(Timestamp, High) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GenericMessage {
    pub Account: GloballyUniqueIdentifier,
    pub CharacterName: StringUTF8,
    pub AccountName: StringUTF8,
    pub Content: StringUTF8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GenericMessage"][::std::mem::size_of::<GenericMessage>() - 40usize];
    ["Alignment of GenericMessage"][::std::mem::align_of::<GenericMessage>() - 8usize];
    ["Offset of field: GenericMessage::Account"]
        [::std::mem::offset_of!(GenericMessage, Account) - 0usize];
    ["Offset of field: GenericMessage::CharacterName"]
        [::std::mem::offset_of!(GenericMessage, CharacterName) - 16usize];
    ["Offset of field: GenericMessage::AccountName"]
        [::std::mem::offset_of!(GenericMessage, AccountName) - 24usize];
    ["Offset of field: GenericMessage::Content"]
        [::std::mem::offset_of!(GenericMessage, Content) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WvWTeamMessage {
    pub Base: GenericMessage,
    pub Map: MapId,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WvWTeamMessage"][::std::mem::size_of::<WvWTeamMessage>() - 48usize];
    ["Alignment of WvWTeamMessage"][::std::mem::align_of::<WvWTeamMessage>() - 8usize];
    ["Offset of field: WvWTeamMessage::Base"]
        [::std::mem::offset_of!(WvWTeamMessage, Base) - 0usize];
    ["Offset of field: WvWTeamMessage::Map"][::std::mem::offset_of!(WvWTeamMessage, Map) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CustomEmoteMessage {
    pub CharacterName: StringUTF8,
    pub ActionTaken: StringUTF8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CustomEmoteMessage"][::std::mem::size_of::<CustomEmoteMessage>() - 16usize];
    ["Alignment of CustomEmoteMessage"][::std::mem::align_of::<CustomEmoteMessage>() - 8usize];
    ["Offset of field: CustomEmoteMessage::CharacterName"]
        [::std::mem::offset_of!(CustomEmoteMessage, CharacterName) - 0usize];
    ["Offset of field: CustomEmoteMessage::ActionTaken"]
        [::std::mem::offset_of!(CustomEmoteMessage, ActionTaken) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EmoteMessage {
    pub CharacterName: StringUTF8,
    pub ActionTaken: EmoteType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EmoteMessage"][::std::mem::size_of::<EmoteMessage>() - 16usize];
    ["Alignment of EmoteMessage"][::std::mem::align_of::<EmoteMessage>() - 8usize];
    ["Offset of field: EmoteMessage::CharacterName"]
        [::std::mem::offset_of!(EmoteMessage, CharacterName) - 0usize];
    ["Offset of field: EmoteMessage::ActionTaken"]
        [::std::mem::offset_of!(EmoteMessage, ActionTaken) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GuildMessage {
    pub Base: GenericMessage,
    pub GuildIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GuildMessage"][::std::mem::size_of::<GuildMessage>() - 48usize];
    ["Alignment of GuildMessage"][::std::mem::align_of::<GuildMessage>() - 8usize];
    ["Offset of field: GuildMessage::Base"][::std::mem::offset_of!(GuildMessage, Base) - 0usize];
    ["Offset of field: GuildMessage::GuildIndex"]
        [::std::mem::offset_of!(GuildMessage, GuildIndex) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GuildMessageOfTheDay {
    pub Content: StringUTF8,
    pub GuildIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GuildMessageOfTheDay"][::std::mem::size_of::<GuildMessageOfTheDay>() - 16usize];
    ["Alignment of GuildMessageOfTheDay"][::std::mem::align_of::<GuildMessageOfTheDay>() - 8usize];
    ["Offset of field: GuildMessageOfTheDay::Content"]
        [::std::mem::offset_of!(GuildMessageOfTheDay, Content) - 0usize];
    ["Offset of field: GuildMessageOfTheDay::GuildIndex"]
        [::std::mem::offset_of!(GuildMessageOfTheDay, GuildIndex) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Message {
    pub DateTime: Timestamp,
    pub Type: MessageType,
    pub Flags: MetadataFlags,
    pub __bindgen_anon_1: Message__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Message__bindgen_ty_1 {
    pub Guild: GuildMessage,
    pub GuildMotD: GuildMessageOfTheDay,
    pub Local: GenericMessage,
    pub Map: GenericMessage,
    pub Party: GenericMessage,
    pub Squad: GenericMessage,
    pub SquadMessage: StringUTF8,
    pub TeamPvP: GenericMessage,
    pub TeamWvW: WvWTeamMessage,
    pub Whisper: GenericMessage,
    pub Emote: EmoteMessage,
    pub EmoteCustom: CustomEmoteMessage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Message__bindgen_ty_1"][::std::mem::size_of::<Message__bindgen_ty_1>() - 48usize];
    ["Alignment of Message__bindgen_ty_1"]
        [::std::mem::align_of::<Message__bindgen_ty_1>() - 8usize];
    ["Offset of field: Message__bindgen_ty_1::Guild"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, Guild) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::GuildMotD"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, GuildMotD) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::Local"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, Local) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::Map"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, Map) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::Party"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, Party) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::Squad"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, Squad) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::SquadMessage"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, SquadMessage) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::TeamPvP"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, TeamPvP) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::TeamWvW"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, TeamWvW) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::Whisper"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, Whisper) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::Emote"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, Emote) - 0usize];
    ["Offset of field: Message__bindgen_ty_1::EmoteCustom"]
        [::std::mem::offset_of!(Message__bindgen_ty_1, EmoteCustom) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Message"][::std::mem::size_of::<Message>() - 64usize];
    ["Alignment of Message"][::std::mem::align_of::<Message>() - 8usize];
    ["Offset of field: Message::DateTime"][::std::mem::offset_of!(Message, DateTime) - 0usize];
    ["Offset of field: Message::Type"][::std::mem::offset_of!(Message, Type) - 8usize];
    ["Offset of field: Message::Flags"][::std::mem::offset_of!(Message, Flags) - 12usize];
};
